In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LinearRegression
from sklearn.cluster import KMeans
from sklearn.decomposition import PCA

In [5]:
pd.set_option('future.no_silent_downcasting', True)
dtype_mapping = {
    'integer_column': 'int32',
    'float_column': 'float32',
    'category_column': 'category'
}

In [ ]:
modeldata = pd.read_csv("/mnt/pnydata/big_csv/kaggle/hospital_prices.csv",dtype=dtype_mapping) #load data

In [3]:
print(modeldata.head())
print(modeldata.tail())

   {F887F88E-7D15-4415-804E-52EAC2F10958}  70000  1995-07-07 00:00 MK15 9HP  \
0  {40FD4DF2-5362-407C-92BC-566E2CCE89E9}  44500  1995-02-03 00:00  SR6 0AQ
1  {7A99F89E-7D81-4E45-ABD5-566E49A045EA}  56500  1995-01-13 00:00  CO6 1SQ
2  {28225260-E61C-4E57-8B56-566E5285B1C1}  58000  1995-07-28 00:00  B90 4TG
3  {444D34D7-9BA6-43A7-B695-4F48980E0176}  51000  1995-06-28 00:00  DY5 1SA
4  {AE76CAF1-F8CC-43F9-8F63-4F48A2857D41}  17000  1995-03-10 00:00  S65 1QJ

   D  N  F  31 Unnamed: 8     ALDRICH DRIVE         WILLEN  MILTON KEYNES  \
0  T  N  F  50        NaN       HOWICK PARK     SUNDERLAND     SUNDERLAND
1  T  N  F  19        NaN  BRICK KILN CLOSE     COGGESHALL     COLCHESTER
2  T  N  F  37        NaN  RAINSBROOK DRIVE        SHIRLEY       SOLIHULL
3  S  N  F  59        NaN        MERRY HILL  BRIERLEY HILL  BRIERLEY HILL
4  T  N  L  22        NaN     DENMAN STREET      ROTHERHAM      ROTHERHAM

  MILTON KEYNES.1  MILTON KEYNES.2  A A.1
0      SUNDERLAND    TYNE AND WEAR  A   A
1       BRAINTREE            ESSEX  A   A
2        SOLIHULL    WEST MIDLANDS  A   A
3          DUDLEY    WEST MIDLANDS  A   A
4       ROTHERHAM  SOUTH YORKSHIRE  A   A
          {F887F88E-7D15-4415-804E-52EAC2F10958}   70000  1995-07-07 00:00  \
28276222  {F3B6C198-17C3-6E40-E053-6C04A8C0B3B4}  490000  2023-01-13 00:00
28276223  {F3B6C198-17C9-6E40-E053-6C04A8C0B3B4}  365000  2023-01-10 00:00
28276224  {F3B6C198-17D8-6E40-E053-6C04A8C0B3B4}  730000  2023-01-05 00:00
28276225  {F3B6C198-1807-6E40-E053-6C04A8C0B3B4}  379000  2023-01-06 00:00
28276226  {F3B6C198-182F-6E40-E053-6C04A8C0B3B4}  450000  2023-01-05 00:00

          MK15 9HP  D  N  F                  31 Unnamed: 8  \
28276222   RM1 4SR  T  N  F                  12        NaN
28276223   SS2 4UA  F  N  L  CENTENARY PLACE, 1    FLAT 22
28276224  CO13 0EY  S  N  F           HIGH VIEW        NaN
28276225  CO15 5NA  D  N  F                  12        NaN
28276226   CO7 7PZ  D  N  F                  21        NaN

                  ALDRICH DRIVE          WILLEN    MILTON KEYNES  \
28276222           HEATHER GLEN             NaN          ROMFORD
28276223  SOUTHCHURCH BOULEVARD             NaN  SOUTHEND-ON-SEA
28276224    LITTLE CLACTON ROAD   GREAT HOLLAND   FRINTON-ON-SEA
28276225           DULWICH ROAD  HOLLAND-ON-SEA   CLACTON-ON-SEA
28276226          INGRAMS PIECE        ARDLEIGH       COLCHESTER

          MILTON KEYNES.1  MILTON KEYNES.2  A A.1
28276222         HAVERING   GREATER LONDON  A   A
28276223  SOUTHEND-ON-SEA  SOUTHEND-ON-SEA  A   A
28276224         TENDRING            ESSEX  A   A
28276225         TENDRING            ESSEX  A   A
28276226         TENDRING            ESSEX  A   A

In [4]:
print(f"Dataset contains {modeldata.shape[0]} rows and {modeldata.shape[1]} columns.\n")
modeldata.describe()

Dataset contains 28276227 rows and 16 columns.

              70000
count  2.827623e+07
mean   2.181305e+05
std    8.688525e+05
min    1.000000e+00
25%    8.495000e+04
50%    1.499500e+05
75%    2.475000e+05
max    5.943000e+08

In [5]:
modeldata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28276227 entries, 0 to 28276226
Data columns (total 16 columns):
 #   Column                                  Dtype
---  ------                                  -----
 0   {F887F88E-7D15-4415-804E-52EAC2F10958}  object
 1   70000                                   int64
 2   1995-07-07 00:00                        object
 3   MK15 9HP                                object
 4   D                                       object
 5   N                                       object
 6   F                                       object
 7   31                                      object
 8   Unnamed: 8                              object
 9   ALDRICH DRIVE                           object
 10  WILLEN                                  object
 11  MILTON KEYNES                           object
 12  MILTON KEYNES.1                         object
 13  MILTON KEYNES.2                         object
 14  A                                       object
 15  A.1                                     object
dtypes: int64(1), object(15)
memory usage: 3.4+ GB